---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.IsRightHanded
source: html/5fe9f7b7-332c-f33b-ecb2-d9ba1445562f.htm
---
# Autodesk.Revit.DB.CylindricalHelix.IsRightHanded Property

True if the helix is right handed, false if the helix is left handed.

## Syntax (C#)
```csharp
public bool IsRightHanded { get; }
```